УНФ_ТЕСТ/src/InformationRegisters/КП_ОбработкаТочек/КП_ОбработкаТочек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_ОбработкаТочек</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.КП_СостояниеТочек</types>
    </type>
  </resources>
  <resources>
    <name>ПерешлиКТочке</name>
    <comment>Заполняется только для Условий и Выбора</comment>
    <type>
      <types>CatalogRef.КП_ТочкиПроцессов</types>
    </type>
  </resources>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.КП_БизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаКБП</name>
    <type>
      <types>CatalogRef.КП_ТочкиПроцессов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПрохода</name>
    <comment>Номер прохода в цикле схемы бизнес-процесса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/КП_ОбработкаТочек/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура КорпоративныйПроцессПриИзменении(Элемент)
	
	ОбновитьСписок();
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок()
	Список.ТекстЗапроса=ПолучитьТекстЗапроса();
	
	Если ЗначениеЗаполнено(КорпоративныйПроцесс) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("БизнесПроцесс", КорпоративныйПроцесс);
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	
	ТекстЗапроса="
		|	ВЫБРАТЬ
		|	РегистрСведенийаДокументооборотОбработкаТочек.Период,
		|	РегистрСведенийаДокументооборотОбработкаТочек.БизнесПроцесс,
		|	РегистрСведенийаДокументооборотОбработкаТочек.ТочкаКБП,
		|	РегистрСведенийаДокументооборотОбработкаТочек.НомерПрохода,
		|	РегистрСведенийаДокументооборотОбработкаТочек.Состояние,
		|	РегистрСведенийаДокументооборотОбработкаТочек.Примечание
		|ИЗ
		|	РегистрСведений.КП_ОбработкаТочек КАК РегистрСведенийаДокументооборотОбработкаТочек
		|";
		
		
	Если ЗначениеЗаполнено(КорпоративныйПроцесс) Тогда
		ТекстЗапроса=ТекстЗапроса+" ГДЕ РегистрСведенийаДокументооборотОбработкаТочек.БизнесПроцесс=&БизнесПроцесс";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции
